devbis/zephyr-tlsr8258/subsys/zigbee/nwk/nwk_ed_minimal.c
	out->headerLen = idx;
	return TRUE;
}

static void nwk_ed_minimal_apply_tc_context(void)
{
	const u8 *tcAddr = NULL;
	bool centralized = FALSE;

	if (!ZB_IEEE_ADDR_IS_ZERO(g_nwkEdCtx.fixedJoinTcAddr) &&
	    !ZB_IEEE_ADDR_IS_INVALID(g_nwkEdCtx.fixedJoinTcAddr)) {
		tcAddr = g_nwkEdCtx.fixedJoinTcAddr;
		centralized = TRUE;
	} else if (!ZB_IEEE_ADDR_IS_ZERO(ss_ib.trust_center_address) &&
		   !ZB_IEEE_ADDR_IS_INVALID(ss_ib.trust_center_address)) {
		tcAddr = ss_ib.trust_center_address;
		centralized = TRUE;
	}

	if (centralized) {
		ZB_IEEE_ADDR_COPY(ss_ib.trust_center_address, tcAddr);
		ss_securityModeSet(SS_SEMODE_CENTRALIZED);
		LOG_INF("join security: centralized tc=%02x:%02x:%02x:%02x:%02x:%02x:%02x:%02x",
			tcAddr[0], tcAddr[1], tcAddr[2], tcAddr[3],
			tcAddr[4], tcAddr[5], tcAddr[6], tcAddr[7]);
	} else {
		ZB_IEEE_ADDR_INVALID(ss_ib.trust_center_address);
		ss_securityModeSet(SS_SEMODE_DISTRIBUTED);
		LOG_INF("join security: distributed/no tc");
	}
}

static bool nwk_ed_minimal_parse_beacon_candidate(const u8 *psdu, u8 len,
						  const nwk_ed_minimal_mac_hdr_t *hdr,
						  u16 *panId, u16 *coordShortAddr, extPANId_t extPanId)
{
	u8 idx;
	u8 gtsSpec;
	u8 pendingSpec;
	u8 gtsDescCount;
	u8 pendingShortCount;
	u8 pendingExtCount;
	u8 superframeSpec2;

	if (psdu == NULL || hdr == NULL || panId == NULL || coordShortAddr == NULL ||
	    extPanId == NULL || !hdr->srcPanValid || !hdr->srcShortValid) {
		return FALSE;
	}

	idx = hdr->headerLen;
	if (idx + 3U > len) {
		return FALSE;
	}

	/* Superframe specification: association permit is bit 7 of second byte. */
	superframeSpec2 = psdu[idx + 1U];
	if ((superframeSpec2 & BIT(7)) == 0U) {
		return FALSE;
	}

	idx += 2U;
	gtsSpec = psdu[idx++];
	gtsDescCount = (u8)(gtsSpec & 0x07U);
	if (gtsDescCount > 0U) {
		u8 gtsLen = (u8)(1U + (gtsDescCount * 3U));
		if (idx + gtsLen > len) {
			return FALSE;
		}
		idx = (u8)(idx + gtsLen);
	}

	if (idx + 1U > len) {
		return FALSE;
	}
	pendingSpec = psdu[idx++];
	pendingShortCount = (u8)(pendingSpec & 0x07U);
	pendingExtCount = (u8)((pendingSpec >> 4) & 0x07U);

	if (idx + (pendingShortCount * 2U) + (pendingExtCount * 8U) + 11U > len) {
		return FALSE;
	}
	idx = (u8)(idx + (pendingShortCount * 2U) + (pendingExtCount * 8U));

	/* Beacon payload: protocol_id(1), stack/version(1), capacity/depth(1), extPAN(8), ... */
	memcpy(extPanId, &psdu[idx + 3U], sizeof(extPANId_t));
	*panId = hdr->srcPanId;
	*coordShortAddr = hdr->srcShortAddr;

	return TRUE;
}

static void nwk_ed_minimal_channel_set(u8 channel)
{
	rf_setChannel(channel);
	(void)tl_zbMacAttrSet(MAC_PHY_ATTR_CURRENT_CHANNEL, &channel, sizeof(channel));
}

static bool nwk_ed_minimal_get_join_profile(struct zb_platform_bdb_join_profile *profile)
{
	if (profile == NULL) {
		return FALSE;
	}

	memset(profile, 0, sizeof(*profile));
	return zb_platform_app_get_join_profile(profile) ? TRUE : FALSE;
}

static bool nwk_ed_minimal_beacon_matches_join_profile(
	const nwk_ed_minimal_rx_evt_t *evt,
	const struct zb_platform_bdb_join_profile *profile)
{
	if (evt == NULL || profile == NULL) {
		return FALSE;
	}

	if (profile->pan_id_valid && evt->beacon.panId != profile->pan_id) {
		return FALSE;
	}

	if (profile->ext_pan_id_valid &&
	    memcmp(evt->beacon.extPanId, profile->ext_pan_id, sizeof(evt->beacon.extPanId)) != 0) {
		return FALSE;
	}

	return TRUE;
}

static bool nwk_ed_minimal_rx_evt_push(const nwk_ed_minimal_rx_evt_t *evt)
{
	k_spinlock_key_t key;

	if (evt == NULL) {
		return FALSE;
	}

	key = k_spin_lock(&g_nwkEdRxEvtLock);
	if (g_nwkEdRxEvtCount >= NWK_ED_MINIMAL_RX_EVT_Q_LEN) {
		k_spin_unlock(&g_nwkEdRxEvtLock, key);
		return FALSE;
	}

	g_nwkEdRxEvtQ[g_nwkEdRxEvtHead] = *evt;
	g_nwkEdRxEvtHead = (u8)((g_nwkEdRxEvtHead + 1U) % NWK_ED_MINIMAL_RX_EVT_Q_LEN);
	g_nwkEdRxEvtCount++;
	k_spin_unlock(&g_nwkEdRxEvtLock, key);

	return TRUE;
}

static bool nwk_ed_minimal_rx_evt_pop(nwk_ed_minimal_rx_evt_t *evt)
{
	k_spinlock_key_t key;

	if (evt == NULL) {
		return FALSE;
	}

	key = k_spin_lock(&g_nwkEdRxEvtLock);
	if (g_nwkEdRxEvtCount == 0U) {
		k_spin_unlock(&g_nwkEdRxEvtLock, key);
		return FALSE;
	}

	*evt = g_nwkEdRxEvtQ[g_nwkEdRxEvtTail];
	g_nwkEdRxEvtTail = (u8)((g_nwkEdRxEvtTail + 1U) % NWK_ED_MINIMAL_RX_EVT_Q_LEN);
	g_nwkEdRxEvtCount--;
	k_spin_unlock(&g_nwkEdRxEvtLock, key);

	return TRUE;
}

static void nwk_ed_minimal_finish_discovery(u8 status)
{
	bool rejoinFlow = g_nwkEdCtx.discoveryForRejoin;
	nwk_ed_minimal_timer_cancel();
	g_nwkEdCtx.state = NWK_ED_MINIMAL_STATE_IDLE;
	g_nwkEdCtx.discoveryForRejoin = FALSE;
	g_nwkEdCtx.lastJoinStatus = status;

	if (!rejoinFlow) {
		tl_zdoEdMinimalDiscoveryDone(status);
	}
}

static void nwk_ed_minimal_finish_join(u8 status, bool rejoinMode)
{
	nwk_ed_minimal_timer_cancel();
	g_nwkEdCtx.state = NWK_ED_MINIMAL_STATE_IDLE;
	g_nwkEdCtx.rejoinWithBackoff = FALSE;
	g_nwkEdCtx.discoveryForRejoin = FALSE;
	g_nwkEdCtx.lastJoinStatus = status;

	if (status != ZDO_SUCCESS && !rejoinMode) {
		g_zbNwkCtx.joined = 0;
	}

	tl_zdoEdMinimalJoinDone(status, rejoinMode);
}

static void nwk_ed_minimal_complete_join(bool rejoinMode)
{
	g_zbNwkCtx.joined = 1U;
	g_zbNwkCtx.is_factory_new = 0U;
	g_zbNwkCtx.parentIsChanged = 0U;
	g_zbNwkCtx.state = NLME_STATE_IDLE;
	g_zbNwkCtx.user_state = NLME_IDLE;
	zb_info_save(NULL);

	LOG_INF("%s complete: short 0x%04x pan 0x%04x parent 0x%04x",
		rejoinMode ? "rejoin" : "join", g_zbNIB.nwkAddr, g_zbNIB.panId,
		g_zbMacPib.coordShortAddress);
	nwk_ed_minimal_finish_join(ZDO_SUCCESS, rejoinMode);
}

static void nwk_ed_minimal_enter_interview(bool rejoinMode)
{
	g_nwkEdCtx.state = NWK_ED_MINIMAL_STATE_INTERVIEW;
	g_nwkEdCtx.interviewRejoinMode = rejoinMode;
	g_nwkEdCtx.assocPollCount = 0U;
	nwk_ed_minimal_timer_start(NWK_ED_MINIMAL_INTERVIEW_POLL_MS);
}

static bool nwk_ed_minimal_send_data_request(void)
{
	u8 frame[MAC_FCF_FIELD_LEN + MAC_SEQ_NUM_FIELD_LEN + MAC_PAN_ID_FIELD_LEN +
		 MAC_SHORT_ADDR_FIELD_LEN + MAC_EXT_ADDR_FIELD_LEN + 1U];
	u8 idx = 0;
	u16 fcf = 0;
	bool useShortSrc = (g_nwkEdCtx.state == NWK_ED_MINIMAL_STATE_INTERVIEW || g_zbNwkCtx.joined) &&
			   (g_zbMacPib.shortAddress < ZB_MAC_SHORT_ADDR_NOT_ALLOCATED);
	int rc;

