devbis/zephyr-tlsr8258/subsys/zigbee/nwk/nwk_ed_minimal.c
	fcf |= MAC_FRAME_COMMAND;
	fcf |= MAC_FCF_ACK_REQ_BIT;
	fcf |= MAC_FCF_INTRA_PAN_MASK;
	fcf |= (u16)ZB_ADDR_16BIT_DEV_OR_BROADCAST << MAC_FCF_DST_ADDR_MODE_POS;
	fcf |= (u16)(useShortSrc ? ZB_ADDR_16BIT_DEV_OR_BROADCAST : ZB_ADDR_64BIT_DEV)
	       << MAC_FCF_SRC_ADDR_MODE_POS;

	COPY_U16TOBUFFER(&frame[idx], fcf);
	idx += MAC_FCF_FIELD_LEN;
	frame[idx++] = ZB_MAC_DSN();
	ZB_INC_MAC_DSN();
	COPY_U16TOBUFFER(&frame[idx], g_nwkEdCtx.activePanId);
	idx += MAC_PAN_ID_FIELD_LEN;
	COPY_U16TOBUFFER(&frame[idx], g_nwkEdCtx.activeParentShortAddr);
	idx += MAC_SHORT_ADDR_FIELD_LEN;
	if (useShortSrc) {
		COPY_U16TOBUFFER(&frame[idx], g_zbNIB.nwkAddr);
		idx += MAC_SHORT_ADDR_FIELD_LEN;
	} else {
		memcpy(&frame[idx], g_zbMacPib.extAddress, sizeof(addrExt_t));
		idx += sizeof(addrExt_t);
	}
	frame[idx++] = MAC_CMD_DATA_REQUEST;

	rc = zb_platform_radio_send_raw_psdu(frame, idx);
	if (rc < 0) {
		LOG_WRN("data request tx failed (rc=%d len=%u)", rc, idx);
		return FALSE;
	}
	return TRUE;
}

static bool nwk_ed_minimal_start_assoc(bool rejoinMode)
{
	u8 frame[MAC_FCF_FIELD_LEN + MAC_SEQ_NUM_FIELD_LEN + MAC_PAN_ID_FIELD_LEN +
		 MAC_SHORT_ADDR_FIELD_LEN + MAC_EXT_ADDR_FIELD_LEN + 2U];
	u8 idx = 0;
	u16 fcf = 0;
	u8 capability = 0;
	u16 parentShortAddr;
	u16 panId;
	extPANId_t extPanId;
	u8 channel;
	int rc;

	if (g_nwkEdCtx.parentCandidateValid) {
		parentShortAddr = g_nwkEdCtx.parentCandidateShortAddr;
		panId = g_nwkEdCtx.candidatePanId;
		ZB_EXTPANID_COPY(extPanId, g_nwkEdCtx.candidateExtPanId);
		channel = g_nwkEdCtx.activeScanChannel;
	} else if (g_nwkEdCtx.fixedJoinValid) {
		parentShortAddr = g_nwkEdCtx.fixedJoinShortAddr;
		panId = g_nwkEdCtx.fixedJoinPanId;
		ZB_EXTPANID_COPY(extPanId, g_nwkEdCtx.fixedJoinExtPanId);
		channel = g_nwkEdCtx.fixedJoinChannel;
	} else {
		LOG_WRN("join start rejected: no parent candidate");
		return FALSE;
	}

	g_nwkEdCtx.activeChannel = channel;
	g_nwkEdCtx.activePanId = panId;
	g_nwkEdCtx.activeParentShortAddr = parentShortAddr;
	ZB_EXTPANID_COPY(g_nwkEdCtx.activeExtPanId, extPanId);
	g_nwkEdCtx.assocPollCount = 0U;

	nwk_ed_minimal_channel_set(channel);

	fcf |= MAC_FRAME_COMMAND;
	fcf |= MAC_FCF_ACK_REQ_BIT;
	fcf |= MAC_FCF_INTRA_PAN_MASK;
	fcf |= (u16)ZB_ADDR_16BIT_DEV_OR_BROADCAST << MAC_FCF_DST_ADDR_MODE_POS;
	fcf |= (u16)ZB_ADDR_64BIT_DEV << MAC_FCF_SRC_ADDR_MODE_POS;

	COPY_U16TOBUFFER(&frame[idx], fcf);
	idx += MAC_FCF_FIELD_LEN;
	frame[idx++] = ZB_MAC_DSN();
	ZB_INC_MAC_DSN();
	COPY_U16TOBUFFER(&frame[idx], panId);
	idx += MAC_PAN_ID_FIELD_LEN;
	COPY_U16TOBUFFER(&frame[idx], parentShortAddr);
	idx += MAC_SHORT_ADDR_FIELD_LEN;
	memcpy(&frame[idx], g_zbMacPib.extAddress, sizeof(addrExt_t));
	idx += sizeof(addrExt_t);
	frame[idx++] = MAC_CMD_ASSOCIATION_REQUEST;

	capability |= g_zbNIB.capabilityInfo.altPanCoord ? BIT(0) : 0U;
	capability |= g_zbNIB.capabilityInfo.devType ? BIT(1) : 0U;
	capability |= g_zbNIB.capabilityInfo.powerSrc ? BIT(2) : 0U;
	capability |= g_zbMacPib.rxOnWhenIdle ? BIT(3) : 0U;
	capability |= g_zbNIB.capabilityInfo.secuCapability ? BIT(6) : 0U;
	capability |= BIT(7); /* allocate short address */
	frame[idx++] = capability;

	rc = zb_platform_radio_send_raw_psdu(frame, idx);
	if (rc < 0) {
		LOG_WRN("association request tx failed (rc=%d len=%u ch=%u)", rc, idx, channel);
		return FALSE;
	}

	g_nwkEdCtx.state = rejoinMode ? NWK_ED_MINIMAL_STATE_REJOIN : NWK_ED_MINIMAL_STATE_JOINING;
	nwk_ed_minimal_timer_start(NWK_ED_MINIMAL_JOIN_POLL_MS);
	LOG_INF("%s started: pan 0x%04x parent 0x%04x ch %u",
		rejoinMode ? "rejoin" : "join", panId, parentShortAddr, channel);

	return TRUE;
}

static void nwk_ed_minimal_send_beacon_request(void)
{
	int rc = zb_platform_radio_send_beacon_request();

	if (rc < 0) {
		LOG_WRN("beacon request tx failed (rc=%d ch=%u)", rc, g_nwkEdCtx.activeScanChannel);
	}
}

static bool nwk_ed_minimal_start_scan_channel(void)
{
	u8 nextChannel = nwk_ed_minimal_next_scan_channel(g_nwkEdCtx.remainingScanChannels,
							   g_nwkEdCtx.activeScanChannel);

	if (nextChannel == 0xFFU) {
		return FALSE;
	}

	g_nwkEdCtx.remainingScanChannels &= ~((u32)1U << nextChannel);
	g_nwkEdCtx.activeScanChannel = nextChannel;
	nwk_ed_minimal_channel_set(nextChannel);
	rf_setTrxState(RF_STATE_RX);
	nwk_ed_minimal_send_beacon_request();
	nwk_ed_minimal_timer_start(nwk_ed_minimal_scan_window_ms(g_nwkEdCtx.lastScanDuration));
	LOG_INF("discovery scanning channel %u", nextChannel);

	return TRUE;
}

static void nwk_ed_minimal_timer_task(void *arg)
{
	ARG_UNUSED(arg);

	if (g_nwkEdCtx.state == NWK_ED_MINIMAL_STATE_DISCOVERY) {
		if (g_nwkEdCtx.discoveryForRejoin) {
			if (g_nwkEdCtx.haveBeaconCandidate || g_nwkEdCtx.parentCandidateValid) {
				if (!nwk_ed_minimal_start_assoc(TRUE)) {
					nwk_ed_minimal_finish_join(ZDO_NETWORK_LOST, TRUE);
				}
				return;
			}
		} else if (g_nwkEdCtx.haveBeaconCandidate) {
			nwk_ed_minimal_finish_discovery(ZDO_SUCCESS);
			return;
		}

		if (!nwk_ed_minimal_start_scan_channel()) {
			if (g_nwkEdCtx.discoveryForRejoin) {
				nwk_ed_minimal_finish_join(ZDO_NETWORK_LOST, TRUE);
			} else {
				LOG_WRN("discovery finished without beacon candidate");
				nwk_ed_minimal_finish_discovery(ZDO_NO_MATCH);
			}
		}
		return;
	}

	if (g_nwkEdCtx.state == NWK_ED_MINIMAL_STATE_JOINING ||
	    g_nwkEdCtx.state == NWK_ED_MINIMAL_STATE_REJOIN) {
		bool rejoinMode = (g_nwkEdCtx.state == NWK_ED_MINIMAL_STATE_REJOIN);

		if (g_nwkEdCtx.assocPollCount >= NWK_ED_MINIMAL_JOIN_POLL_MAX) {
			LOG_WRN("%s timed out waiting assoc response", rejoinMode ? "rejoin" : "join");
			nwk_ed_minimal_finish_join(rejoinMode ? ZDO_NETWORK_LOST : ZDO_TIMEOUT, rejoinMode);
			return;
		}

		if (!nwk_ed_minimal_send_data_request()) {
		}
		g_nwkEdCtx.assocPollCount++;
		nwk_ed_minimal_timer_start(NWK_ED_MINIMAL_JOIN_POLL_MS);
		return;
	}

	if (g_nwkEdCtx.state == NWK_ED_MINIMAL_STATE_INTERVIEW) {

		if (g_nwkEdCtx.assocPollCount >= NWK_ED_MINIMAL_INTERVIEW_POLL_MAX) {
			LOG_WRN("%s timed out waiting transport key",
				g_nwkEdCtx.interviewRejoinMode ? "rejoin" : "join");
			nwk_ed_minimal_finish_join(g_nwkEdCtx.interviewRejoinMode ?
						      ZDO_NETWORK_LOST : ZDO_TIMEOUT,
					       g_nwkEdCtx.interviewRejoinMode);
			return;
		}

		if (!nwk_ed_minimal_send_data_request()) {
		}
		g_nwkEdCtx.assocPollCount++;
		nwk_ed_minimal_timer_start(NWK_ED_MINIMAL_INTERVIEW_POLL_MS);
		return;
	}

	if (g_nwkEdCtx.state == NWK_ED_MINIMAL_STATE_IDLE &&
	    g_nwkEdCtx.interviewPollCount != 0U &&
	    g_zbNwkCtx.joined) {

		if (!nwk_ed_minimal_send_data_request()) {
		}

		g_nwkEdCtx.interviewPollCount--;
		if (g_nwkEdCtx.interviewPollCount != 0U) {
			nwk_ed_minimal_timer_start(g_nwkEdCtx.interviewPollIntervalMs);
		}
	}
}

