devbis/zephyr-tlsr8258/subsys/zigbee/nwk/nwk_ed_minimal.c
static int nwk_ed_minimal_timer_cb(void *arg)
{
	ARG_UNUSED(arg);
	(void)TL_SCHEDULE_TASK(nwk_ed_minimal_timer_task, NULL);
	return -1;
}

static void nwk_ed_minimal_timer_start(u32 timeoutMs)
{
	if (g_nwkEdCtx.opTimer.cb == NULL) {
		memset(&g_nwkEdCtx.opTimer, 0, sizeof(g_nwkEdCtx.opTimer));
		g_nwkEdCtx.opTimer.cb = nwk_ed_minimal_timer_cb;
	}

	ev_on_timer(&g_nwkEdCtx.opTimer, timeoutMs);
}

static void nwk_ed_minimal_runtime_reset(void)
{
	nwk_ed_minimal_timer_cancel();
	g_nwkEdCtx.state = NWK_ED_MINIMAL_STATE_IDLE;
	g_nwkEdCtx.lastScanChannels = 0U;
	g_nwkEdCtx.lastScanDuration = 0U;
	g_nwkEdCtx.lastRejoinScanChannels = 0U;
	g_nwkEdCtx.lastRejoinScanDuration = 0U;
	g_nwkEdCtx.rejoinWithBackoff = FALSE;
	g_nwkEdCtx.parentCandidateValid = FALSE;
	g_nwkEdCtx.parentCandidateShortAddr = MAC_SHORT_ADDR_NONE;
	ZB_IEEE_ADDR_ZERO(g_nwkEdCtx.parentCandidateIeee);
	g_nwkEdCtx.lastJoinStatus = ZDO_NOT_SUPPORTED;
	g_nwkEdCtx.remainingScanChannels = 0U;
	g_nwkEdCtx.activeScanChannel = 0xFFU;
	g_nwkEdCtx.haveBeaconCandidate = FALSE;
	g_nwkEdCtx.bestBeaconRssi = -127;
	g_nwkEdCtx.candidatePanId = MAC_INVALID_PANID;
	g_nwkEdCtx.candidateShortAddr = MAC_SHORT_ADDR_NONE;
	memset(g_nwkEdCtx.candidateExtPanId, 0, sizeof(g_nwkEdCtx.candidateExtPanId));
	g_nwkEdCtx.discoveryForRejoin = FALSE;
	g_nwkEdCtx.activeChannel = 0xFFU;
	g_nwkEdCtx.activePanId = MAC_INVALID_PANID;
	g_nwkEdCtx.activeParentShortAddr = MAC_SHORT_ADDR_NONE;
	memset(g_nwkEdCtx.activeExtPanId, 0, sizeof(g_nwkEdCtx.activeExtPanId));
	g_nwkEdCtx.assocPollCount = 0U;
	g_nwkEdCtx.interviewRejoinMode = FALSE;
	g_nwkEdCtx.interviewPollCount = 0U;
	g_nwkEdCtx.interviewPollIntervalMs = NWK_ED_MINIMAL_INTERVIEW_POLL_MS;
	g_nwkEdRxEvtHead = 0U;
	g_nwkEdRxEvtTail = 0U;
	g_nwkEdRxEvtCount = 0U;
}

static void nwk_ed_minimal_reset(bool warmStart)
{
	nwk_ed_minimal_runtime_reset();
	g_nwkEdCtx.initialized = TRUE;
	g_nwkEdCtx.warmStart = warmStart;
}

void tl_zbNwkEdMinimalRuntimeReset(void)
{
	nwk_ed_minimal_runtime_reset();
}

bool tl_zbNwkEdMinimalDiscoveryStart(u32 scanChannels, u8 scanDuration)
{
	u32 supportedMask = scanChannels & (((u32)1U << (TL_ZB_MAC_CHANNEL_STOP + 1U)) - 1U);

	if (g_nwkEdCtx.state != NWK_ED_MINIMAL_STATE_IDLE) {
		return FALSE;
	}
	if (supportedMask == 0U) {
		return FALSE;
	}

	g_nwkEdCtx.state = NWK_ED_MINIMAL_STATE_DISCOVERY;
	g_nwkEdCtx.discoveryForRejoin = FALSE;
	g_nwkEdCtx.lastScanChannels = scanChannels;
	g_nwkEdCtx.lastScanDuration = scanDuration;
	g_nwkEdCtx.remainingScanChannels = supportedMask;
	g_nwkEdCtx.activeScanChannel = 10U;
	g_nwkEdCtx.parentCandidateValid = FALSE;
	g_nwkEdCtx.haveBeaconCandidate = FALSE;
	g_nwkEdCtx.bestBeaconRssi = -127;
	g_nwkEdCtx.candidatePanId = MAC_INVALID_PANID;
	g_nwkEdCtx.candidateShortAddr = MAC_SHORT_ADDR_NONE;
	memset(g_nwkEdCtx.candidateExtPanId, 0, sizeof(g_nwkEdCtx.candidateExtPanId));

	if (!nwk_ed_minimal_start_scan_channel()) {
		g_nwkEdCtx.state = NWK_ED_MINIMAL_STATE_IDLE;
		return FALSE;
	}

	return TRUE;
}

void tl_zbNwkEdMinimalDiscoveryStop(void)
{
	if (g_nwkEdCtx.state == NWK_ED_MINIMAL_STATE_DISCOVERY) {
		nwk_ed_minimal_finish_discovery(ZDO_TIMEOUT);
	}
}

bool tl_zbNwkEdMinimalAssocJoinStart(void)
{
	if (g_nwkEdCtx.state != NWK_ED_MINIMAL_STATE_IDLE) {
		return FALSE;
	}

	return nwk_ed_minimal_start_assoc(FALSE);
}

bool tl_zbNwkEdMinimalRejoinStart(u32 scanChannels, u8 scanDuration, bool withBackoff)
{
	u32 supportedMask = scanChannels & (((u32)1U << (TL_ZB_MAC_CHANNEL_STOP + 1U)) - 1U);

	if (g_nwkEdCtx.state != NWK_ED_MINIMAL_STATE_IDLE) {
		return FALSE;
	}

	g_nwkEdCtx.lastRejoinScanChannels = scanChannels;
	g_nwkEdCtx.lastRejoinScanDuration = scanDuration;
	g_nwkEdCtx.rejoinWithBackoff = withBackoff;

	if (g_nwkEdCtx.parentCandidateValid || g_nwkEdCtx.fixedJoinValid) {
		if (!nwk_ed_minimal_start_assoc(TRUE)) {
			g_nwkEdCtx.rejoinWithBackoff = FALSE;
			return FALSE;
		}
		return TRUE;
	}

	if (supportedMask == 0U) {
		g_nwkEdCtx.rejoinWithBackoff = FALSE;
		return FALSE;
	}

	g_nwkEdCtx.state = NWK_ED_MINIMAL_STATE_DISCOVERY;
	g_nwkEdCtx.discoveryForRejoin = TRUE;
	g_nwkEdCtx.lastScanChannels = scanChannels;
	g_nwkEdCtx.lastScanDuration = scanDuration;
	g_nwkEdCtx.remainingScanChannels = supportedMask;
	g_nwkEdCtx.activeScanChannel = 10U;
	g_nwkEdCtx.haveBeaconCandidate = FALSE;
	g_nwkEdCtx.bestBeaconRssi = -127;
	g_nwkEdCtx.candidatePanId = MAC_INVALID_PANID;
	g_nwkEdCtx.candidateShortAddr = MAC_SHORT_ADDR_NONE;
	memset(g_nwkEdCtx.candidateExtPanId, 0, sizeof(g_nwkEdCtx.candidateExtPanId));

	if (!nwk_ed_minimal_start_scan_channel()) {
		g_nwkEdCtx.state = NWK_ED_MINIMAL_STATE_IDLE;
		g_nwkEdCtx.discoveryForRejoin = FALSE;
		g_nwkEdCtx.rejoinWithBackoff = FALSE;
		return FALSE;
	}

	return TRUE;
}

void tl_zbNwkEdMinimalOperationAbort(void)
{
	nwk_ed_minimal_timer_cancel();
	g_nwkEdCtx.state = NWK_ED_MINIMAL_STATE_IDLE;
	g_nwkEdCtx.rejoinWithBackoff = FALSE;
	g_nwkEdCtx.discoveryForRejoin = FALSE;
}

void tl_zbNwkEdMinimalOperationComplete(u8 status)
{
	g_nwkEdCtx.lastJoinStatus = status;
	g_nwkEdCtx.state = NWK_ED_MINIMAL_STATE_IDLE;
	g_nwkEdCtx.rejoinWithBackoff = FALSE;
	g_nwkEdCtx.discoveryForRejoin = FALSE;
}

bool tl_zbNwkEdMinimalManagerIdle(void)
{
	return g_nwkEdCtx.state == NWK_ED_MINIMAL_STATE_IDLE;
}

bool tl_zbNwkEdMinimalCanProcessDataFrames(void)
{
	return g_zbNwkCtx.joined || (g_nwkEdCtx.state == NWK_ED_MINIMAL_STATE_INTERVIEW);
}

void tl_zbNwkEdMinimalTransportKeyDone(void)
{
	if (g_nwkEdCtx.state != NWK_ED_MINIMAL_STATE_INTERVIEW) {
		return;
	}

	nwk_ed_minimal_complete_join(g_nwkEdCtx.interviewRejoinMode);
}

void tl_zbNwkEdMinimalInterviewPollStart(u8 count, u32 intervalMs)
{
	if (!g_zbNwkCtx.joined || g_nwkEdCtx.activePanId == MAC_INVALID_PANID ||
	    g_nwkEdCtx.activeParentShortAddr == MAC_SHORT_ADDR_NONE) {
		return;
	}

	if (count == 0U) {
		count = NWK_ED_MINIMAL_INTERVIEW_POLL_MAX;
	}

	g_nwkEdCtx.interviewPollCount = count;
	g_nwkEdCtx.interviewPollIntervalMs =
		(intervalMs != 0U) ? intervalMs : NWK_ED_MINIMAL_INTERVIEW_POLL_MS;
	nwk_ed_minimal_timer_start(1U);
}

