devbis/zephyr-tlsr8258/subsys/zigbee/nwk/nwk_ed_minimal.c
u32 tl_zbNwkEdMinimalLastScanChannelsGet(void)
{
	return g_nwkEdCtx.lastScanChannels;
}

u32 tl_zbNwkEdMinimalLastRejoinScanChannelsGet(void)
{
	return g_nwkEdCtx.lastRejoinScanChannels;
}

void tl_zbNwkEdMinimalParentCandidateSet(u16 parentShortAddr, const addrExt_t parentIeeeAddr)
{
	g_nwkEdCtx.parentCandidateValid = TRUE;
	g_nwkEdCtx.parentCandidateShortAddr = parentShortAddr;
	if (parentIeeeAddr != NULL) {
		ZB_IEEE_ADDR_COPY(g_nwkEdCtx.parentCandidateIeee, parentIeeeAddr);
	} else {
		ZB_IEEE_ADDR_ZERO(g_nwkEdCtx.parentCandidateIeee);
	}
}

void tl_zbNwkEdMinimalParentCandidateClear(void)
{
	g_nwkEdCtx.parentCandidateValid = FALSE;
	g_nwkEdCtx.parentCandidateShortAddr = MAC_SHORT_ADDR_NONE;
	ZB_IEEE_ADDR_ZERO(g_nwkEdCtx.parentCandidateIeee);
}

bool tl_zbNwkEdMinimalParentCandidateGet(u16 *parentShortAddr, addrExt_t parentIeeeAddr)
{
	if (!g_nwkEdCtx.parentCandidateValid) {
		return FALSE;
	}

	if (parentShortAddr != NULL) {
		*parentShortAddr = g_nwkEdCtx.parentCandidateShortAddr;
	}
	if (parentIeeeAddr != NULL) {
		ZB_IEEE_ADDR_COPY(parentIeeeAddr, g_nwkEdCtx.parentCandidateIeee);
	}

	return TRUE;
}

void tl_zbNwkEdMinimalSetFixedJoinTarget(u8 channel, u16 panId, u16 shortAddr,
					 const u8 *extPanId, const u8 *nwkKey, const u8 *tcAddr)
{
	g_nwkEdCtx.fixedJoinValid = TRUE;
	g_nwkEdCtx.fixedJoinChannel = channel;
	g_nwkEdCtx.fixedJoinPanId = panId;
	g_nwkEdCtx.fixedJoinShortAddr = shortAddr;
	if (extPanId != NULL) {
		ZB_EXTPANID_COPY(g_nwkEdCtx.fixedJoinExtPanId, extPanId);
	} else {
		memset(g_nwkEdCtx.fixedJoinExtPanId, 0, sizeof(g_nwkEdCtx.fixedJoinExtPanId));
	}
	if (nwkKey != NULL) {
		memcpy(g_nwkEdCtx.fixedJoinNwkKey, nwkKey, sizeof(g_nwkEdCtx.fixedJoinNwkKey));
	} else {
		memset(g_nwkEdCtx.fixedJoinNwkKey, 0, sizeof(g_nwkEdCtx.fixedJoinNwkKey));
	}
	if (tcAddr != NULL) {
		ZB_IEEE_ADDR_COPY(g_nwkEdCtx.fixedJoinTcAddr, tcAddr);
	} else {
		ZB_IEEE_ADDR_ZERO(g_nwkEdCtx.fixedJoinTcAddr);
	}
}

bool tl_zbNwkEdMinimalGetFixedJoinTarget(u8 *channel, u16 *panId, u16 *shortAddr,
					 extPANId_t extPanId, u8 *nwkKey, addrExt_t tcAddr)
{
	if (!g_nwkEdCtx.fixedJoinValid) {
		return FALSE;
	}

	if (channel != NULL) {
		*channel = g_nwkEdCtx.fixedJoinChannel;
	}
	if (panId != NULL) {
		*panId = g_nwkEdCtx.fixedJoinPanId;
	}
	if (shortAddr != NULL) {
		*shortAddr = g_nwkEdCtx.fixedJoinShortAddr;
	}
	if (extPanId != NULL) {
		ZB_EXTPANID_COPY(extPanId, g_nwkEdCtx.fixedJoinExtPanId);
	}
	if (nwkKey != NULL) {
		memcpy(nwkKey, g_nwkEdCtx.fixedJoinNwkKey, sizeof(g_nwkEdCtx.fixedJoinNwkKey));
	}
	if (tcAddr != NULL) {
		ZB_IEEE_ADDR_COPY(tcAddr, g_nwkEdCtx.fixedJoinTcAddr);
	}

	return TRUE;
}

void tl_zbNwkInit(u8 coldReset)
{
	nwk_ed_minimal_reset(coldReset ? FALSE : TRUE);
}

void tl_zbNwkNlmeResetRequestHandler(void *arg)
{
	nlme_reset_req_t *pReq = (nlme_reset_req_t *)arg;
	nlme_reset_cnf_t cnf = {.status = NWK_STATUS_SUCCESS};

	nwk_ed_minimal_reset((pReq != NULL) ? pReq->warmStart : FALSE);

	if (zdoAppIndCbLst != NULL && zdoAppIndCbLst->zdpResetCnfCb != NULL) {
		zdoAppIndCbLst->zdpResetCnfCb(&cnf);
	}
}

void tl_zbNwkTaskProc(void)
{
}

static void nwk_ed_minimal_handle_beacon_event(const nwk_ed_minimal_rx_evt_t *evt)
{
	struct zb_platform_bdb_join_profile profile;
	bool have_profile;

	if (evt == NULL || g_nwkEdCtx.state != NWK_ED_MINIMAL_STATE_DISCOVERY) {
		return;
	}

	have_profile = nwk_ed_minimal_get_join_profile(&profile);
	if (have_profile && !nwk_ed_minimal_beacon_matches_join_profile(evt, &profile)) {
		return;
	}

	if (!g_nwkEdCtx.haveBeaconCandidate || (evt->rssi > g_nwkEdCtx.bestBeaconRssi)) {
		g_nwkEdCtx.haveBeaconCandidate = TRUE;
		g_nwkEdCtx.bestBeaconRssi = evt->rssi;
		g_nwkEdCtx.candidatePanId = evt->beacon.panId;
		g_nwkEdCtx.candidateShortAddr = evt->beacon.parentShortAddr;
		ZB_EXTPANID_COPY(g_nwkEdCtx.candidateExtPanId, evt->beacon.extPanId);
		tl_zbNwkEdMinimalParentCandidateSet(evt->beacon.parentShortAddr, NULL);
		tl_zbNwkEdMinimalSetFixedJoinTarget(evt->beacon.channel, evt->beacon.panId,
						    evt->beacon.parentShortAddr, evt->beacon.extPanId,
						    have_profile && profile.network_key_valid ? profile.network_key : NULL,
						    have_profile && profile.tc_addr_valid ? profile.tc_addr : NULL);
		if (have_profile) {
			LOG_INF("matched beacon candidate: pan 0x%04x parent 0x%04x ch %u rssi %d",
				evt->beacon.panId, evt->beacon.parentShortAddr, evt->beacon.channel,
				evt->rssi);
		} else {
			LOG_INF("beacon candidate: pan 0x%04x parent 0x%04x ch %u rssi %d",
				evt->beacon.panId, evt->beacon.parentShortAddr, evt->beacon.channel,
				evt->rssi);
		}
	}
}

static void nwk_ed_minimal_handle_traffic_candidate_event(const nwk_ed_minimal_rx_evt_t *evt)
{
	bool preferNewCandidate;

	if (evt == NULL || g_nwkEdCtx.state != NWK_ED_MINIMAL_STATE_DISCOVERY) {
		return;
	}

	if (g_nwkEdCtx.haveBeaconCandidate) {
		return;
	}

	preferNewCandidate = !g_nwkEdCtx.parentCandidateValid;
	if (!preferNewCandidate &&
	    g_nwkEdCtx.candidateShortAddr != MAC_SHORT_ADDR_BROADCAST &&
	    evt->traffic.parentShortAddr == 0x0000U) {
		preferNewCandidate = TRUE;
	}
	if (!preferNewCandidate && evt->rssi > g_nwkEdCtx.bestBeaconRssi) {
		preferNewCandidate = TRUE;
	}

	if (preferNewCandidate) {
		g_nwkEdCtx.bestBeaconRssi = evt->rssi;
		g_nwkEdCtx.candidatePanId = evt->traffic.panId;
		g_nwkEdCtx.candidateShortAddr = evt->traffic.parentShortAddr;
		memset(g_nwkEdCtx.candidateExtPanId, 0, sizeof(g_nwkEdCtx.candidateExtPanId));
		tl_zbNwkEdMinimalParentCandidateSet(evt->traffic.parentShortAddr, NULL);
		tl_zbNwkEdMinimalSetFixedJoinTarget(evt->traffic.channel, evt->traffic.panId,
						    evt->traffic.parentShortAddr, NULL,
						    NULL, NULL);
		LOG_INF("traffic candidate: pan 0x%04x parent 0x%04x ch %u rssi %d",
			evt->traffic.panId, evt->traffic.parentShortAddr,
			evt->traffic.channel, evt->rssi);
	}
}

static void nwk_ed_minimal_handle_assoc_rsp_event(const nwk_ed_minimal_rx_evt_t *evt)
{
	u8 zdoStatus;
	bool rejoinMode;

	if (evt == NULL) {
		return;
	}
	if (g_nwkEdCtx.state != NWK_ED_MINIMAL_STATE_JOINING &&
	    g_nwkEdCtx.state != NWK_ED_MINIMAL_STATE_REJOIN) {
		return;
	}

	rejoinMode = (g_nwkEdCtx.state == NWK_ED_MINIMAL_STATE_REJOIN);
	if (evt->assocRsp.srcShortValid &&
	    evt->assocRsp.srcShortAddr != g_nwkEdCtx.activeParentShortAddr) {
		return;
	}
	if (evt->assocRsp.dstExtValid &&
	    memcmp(evt->assocRsp.dstExtAddr, g_zbMacPib.extAddress, sizeof(addrExt_t)) != 0) {
		return;
	}
	if (evt->assocRsp.dstShortValid &&
	    evt->assocRsp.dstShortAddr != MAC_SHORT_ADDR_BROADCAST &&
	    evt->assocRsp.dstShortAddr != g_zbMacPib.shortAddress) {
		return;
	}

	if (evt->assocRsp.macStatus == MAC_SUCCESS) {
		if (evt->assocRsp.srcExtValid) {
			tl_zbNwkEdMinimalParentCandidateSet(g_nwkEdCtx.activeParentShortAddr,
							      evt->assocRsp.srcExtAddr);
		}
		nwk_ed_minimal_apply_tc_context();

		g_zbMacPib.panId = g_nwkEdCtx.activePanId;
		g_zbMacPib.shortAddress = evt->assocRsp.assignedShortAddr;
		g_zbMacPib.coordShortAddress = g_nwkEdCtx.activeParentShortAddr;
		g_zbMacPib.associatedPanCoord = TRUE;
		tlsr8258_zigbee_update_filters(g_nwkEdCtx.activePanId,
						 evt->assocRsp.assignedShortAddr,
						 g_zbMacPib.extAddress);

